## 使用字典或Series分组

In [1]:
import numpy as np
import pandas as pd

In [3]:
people = pd.DataFrame(np.random.randn(5,5),
                     columns=['a', 'b', 'c', 'd', 'e'],
                     index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people

               a         b         c         d         e
Joe    -0.150805 -0.039827 -1.030010  0.900367  1.000069
Steve   0.172689  0.101859  0.458750 -0.825091 -1.225543
Wes     0.626510 -0.938039  1.411302  0.132342  1.082714
Jim    -0.728784  0.245977 -0.330224  0.084638 -0.215106
Travis  1.642235 -0.010885 -0.073394  1.230261 -0.089962

In [6]:
# 制造缺失值
people.iloc[2:3, [1, 2]] = np.nan
people

               a         b         c         d         e
Joe    -0.150805 -0.039827 -1.030010  0.900367  1.000069
Steve   0.172689  0.101859  0.458750 -0.825091 -1.225543
Wes     0.626510       NaN       NaN  0.132342  1.082714
Jim    -0.728784  0.245977 -0.330224  0.084638 -0.215106
Travis  1.642235 -0.010885 -0.073394  1.230261 -0.089962

In [7]:
### 列上，对应关系；按组累加
mapping = {'a': 'red', 'b':'red', 'c':'blue',
          'd':'blue', 'e':'red', 'f':'orange'}

In [8]:
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe    -0.129643  0.809438
Steve  -0.366341 -0.950995
Wes     0.132342  1.709225
Jim    -0.245585 -0.697914
Travis  1.156867  1.541388

In [9]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [10]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3